tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf8410_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18LF8410_H_
#define _PIC18LF8410_H_

#define RCSTA2                        0
#define RCD82                         1
#define RX9D2                         2
#define RCSTA2_RCD8                   3
#define RCSTA2_RX9D                   4
#define RCSTA2_OERR                   5
#define OERR2                         6
#define FERR2                         7
#define RCSTA2_FERR                   8
#define RCSTA2_ADEN                   9
#define ADDEN2                        10
#define RCSTA2_ADDEN                  11
#define RCSTA2_CREN                   12
#define CREN2                         13
#define SREN2                         14
#define RCSTA2_SREN                   15
#define RC92                          16
#define RCSTA2_RX9                    17
#define RCSTA2_RC9                    18
#define RC8_92                        19
#define RCSTA2_RC8_9                  20
#define nRC8                          21
#define NOT_RC8                       22
#define RX92                          23
#define RCSTA2_SPEN                   24
#define SPEN2                         25
#define TXSTA2                        26
#define TXSTA2_TXD8                   27
#define TX9D2                         28
#define TXSTA2_TX9D                   29
#define TXD82                         30
#define TRMT2                         31
#define TXSTA2_TRMT                   32
#define BRGH2                         33
#define TXSTA2_BRGH                   34
#define SENDB2                        35
#define TXSTA2_SYNC                   36
#define SYNC2                         37
#define TXEN2                         38
#define TXSTA2_TXEN                   39
#define TX8_92                        40
#define TX92                          41
#define TXSTA2_TX9                    42
#define NOT_TX8                       43
#define nTX8                          44
#define TXSTA2_TX8_9                  45
#define TXSTA2_CSRC                   46
#define CSRC2                         47
#define BAUDCON1                      48
#define ABDEN1                        49
#define ABDEN                         50
#define WUE1                          51
#define WUE                           52
#define BRG16                         53
#define BRG161                        54
#define SCKP                          55
#define TXCKP                         56
#define SCKP1                         57
#define TXCKP1                        58
#define CKTXP                         59
#define RCMT                          60
#define RCIDL                         61
#define RCIDL1                        62
#define RCMT1                         63
#define ABDOVF                        64
#define ABDOVF1                       65
#define PORTA                         66
#define AN0                           67
#define ULPWUIN                       68
#define PORTA_RA0                     69
#define AN1                           70
#define PORTA_RA1                     71
#define AN2                           72
#define PORTA_RA2                     73
#define VREFM                         74
#define AN3                           75
#define PORTA_RA3                     76
#define VREFP                         77
#define PORTA_RA4                     78
#define T0CKI                         79
#define AN4                           80
#define PORTA_RA5                     81
#define LVDIN                         82
#define CLKO                          83
#define PORTA_RA6                     84
#define OSC2                          85
#define CLKI                          86
#define PORTA_RA7                     87
#define OSC1                          88
#define PORTA_RJPU                    89
#define PORTB                         90
#define INT0                          91
#define PORTB_RB0                     92
#define INT1                          93
#define PORTB_RB1                     94
#define INT2                          95
#define PORTB_RB2                     96
#define CCP2B                         97
#define INT3                          98
#define CCP2_PA2                      99
#define PORTB_RB3                     100
#define RB4                           101
#define KBI0                          102
#define PGM                           103
#define KBI1                          104
#define PORTB_RB5                     105
#define PGC                           106
#define KBI2                          107
#define PORTB_RB6                     108
#define PGD                           109
#define KBI3                          110
#define PORTB_RB7                     111
#define PORTC                         112
#define T13CKI                        113
#define T1OSO                         114
#define PORTC_RC0                     115
#define CCP2C                         116
#define CCP2                          117
#define T1OSI                         118
#define PA2                           119
#define PORTC_RC1                     120
#define CCP1                          121
#define PA1                           122
#define PORTC_RC2                     123
#define SCL                           124
#define SCK                           125
#define PORTC_RC3                     126
#define SDA                           127
#define SDI                           128
#define PORTC_RC4                     129
#define SDO                           130
#define PORTC_RC5                     131
#define TX                            132
#define CK                            133
#define PORTC_RC6                     134
#define DT                            135
#define RX                            136
#define PORTC_RC7                     137
#define PORTD                         138
#define PSP0                          139
#define PORTD_RD0                     140
#define AD0                           141
#define PSP1                          142
#define PORTD_RD1                     143
#define AD1                           144
#define PSP2                          145
#define AD2                           146
#define PORTD_RD2                     147
#define PSP3                          148
#define AD3                           149
#define PORTD_RD3                     150
#define PORTD_RD4                     151
#define PSP4                          152
#define AD4                           153
#define PSP5                          154
#define AD5                           155
#define PORTD_RD5                     156
#define PSP6                          157
#define AD6                           158
#define PORTD_RD6                     159
#define SS2                           160
#define PSP7                          161
#define AD7                           162
#define PORTD_RD7                     163
#define PORTE                         164
#define PD2                           165
#define AD8                           166
#define RD                            167
#define RDE                           168
#define PORTE_RE0                     169
#define WR                            170
#define AD9                           171
#define WRE                           172
#define PORTE_RE1                     173
#define PC2                           174
#define AD10                          175
#define CCP10                         176
#define PB2                           177
#define PORTE_RE2                     178
#define CS                            179
#define PORTE_RE3                     180
#define CCP9E                         181
#define AD11                          182
#define PC3E                          183
#define PORTE_RE4                     184
#define PB3E                          185
#define AD12                          186
#define CCP8E                         187
#define PORTE_RE5                     188
#define CCP7E                         189
#define AD13                          190
#define PC1E                          191
#define CCP6E                         192
#define PORTE_RE6                     193
#define AD14                          194
#define PB1E                          195
#define CCP2E                         196
#define PA2E                          197
#define PORTE_RE7                     198
#define AD15                          199
#define PORTF                         200
#define PORTF_RF0                     201
#define AN5                           202
#define PORTF_RF1                     203
#define C2OUTF                        204
#define AN6                           205
#define PORTF_RF2                     206
#define AN7                           207
#define C1OUTF                        208
#define PORTF_RF3                     209
#define AN8                           210
#define PORTF_RF4                     211
#define AN9                           212
#define PORTF_RF5                     213
#define AN10                          214
#define CVREFF                        215
#define PORTF_RF6                     216
#define AN11                          217
#define PORTF_RF7                     218
#define SS                            219
#define PORTG                         220
#define PORTG_RG0                     221
#define CCP3                          222
#define TX2                           223
#define PORTG_RG1                     224
#define C3OUTG                        225
#define CK2                           226
#define PORTG_RG2                     227
#define DT2                           228
#define RX2                           229
#define PORTG_RG3                     230
#define PORTG_RG4                     231
#define RG5                           232
#define PORTG_RJPU                    233
#define MCLR                          234
#define VPP                           235
#define PORTH                         236
#define PORTH_RH0                     237
#define A16                           238
#define PORTH_RH1                     239
#define A17                           240
#define PORTH_RH2                     241
#define A18                           242
#define PORTH_RH3                     243
#define A19                           244
#define PORTH_RH4                     245
#define CCP9                          246
#define PC3                           247
#define PORTH_RH5                     248
#define CCP8                          249
#define PB3                           250
#define PORTH_RH6                     251
#define CCP7                          252
#define PC1                           253
#define PORTH_RH7                     254
#define CCP6                          255
#define PB1                           256
#define PORTJ                         257
#define ALE                           258
#define PORTJ_RJ0                     259
#define OE                            260
#define PORTJ_RJ1                     261
#define WRL                           262
#define PORTJ_RJ2                     263
#define WRH                           264
#define PORTJ_RJ3                     265
#define BA0                           266
#define PORTJ_RJ4                     267
#define CE                            268
#define PORTJ_RJ5                     269
#define LB                            270
#define PORTJ_RJ6                     271
#define PORTJ_RJ7                     272
#define UB                            273
#define LATA                          274
#define LATA0                         275
#define LA0                           276
#define LATA1                         277
#define LA1                           278
#define LATA2                         279
#define LA2                           280
#define LATA3                         281
#define LA3                           282
#define LATA4                         283
#define LA4                           284
#define LATA5                         285
#define LA5                           286
#define LATA6                         287
#define LA6                           288
#define LATA7                         289
#define LA7                           290
#define LATB                          291
#define LB0                           292
#define LATB0                         293
#define LB1                           294
#define LATB1                         295
#define LB2                           296
#define LATB2                         297
#define LB3                           298
#define LATB3                         299
#define LB4                           300
#define LATB4                         301
#define LB5                           302
#define LATB5                         303
#define LB6                           304
#define LATB6                         305
#define LB7                           306
#define LATB7                         307
#define LATC                          308
#define LATC0                         309
#define LC0                           310
#define LATC1                         311
#define LC1                           312
#define LATC2                         313
#define LC2                           314
#define LATC3                         315
#define LC3                           316
#define LATC4                         317
#define LC4                           318
#define LATC5                         319
#define LC5                           320
#define LATC6                         321
#define LC6                           322
#define LATC7                         323
#define LC7                           324
#define LATD                          325
#define LATD0                         326
#define LD0                           327
#define LATD1                         328
#define LD1                           329
#define LATD2                         330
#define LD2                           331
#define LATD3                         332
#define LD3                           333
#define LATD4                         334
#define LD4                           335
#define LATD5                         336
#define LD5                           337
#define LATD6                         338
#define LD6                           339
#define LATD7                         340
#define LD7                           341
#define LATE                          342
#define LATE0                         343
#define LE0                           344
#define LATE1                         345
#define LE1                           346
#define LATE2                         347
#define LE2                           348
#define LATE3                         349
#define LE3                           350
#define LATE4                         351
#define LE4                           352
#define LATE5                         353
#define LE5                           354
#define LATE6                         355
#define LE6                           356
#define LATE7                         357
#define LE7                           358
#define LATF                          359
#define LATF0                         360
#define LF0                           361
#define LATF1                         362
#define LF1                           363
#define LF2                           364
#define LATF2                         365
#define LF3                           366
#define LATF3                         367
#define LF4                           368
#define LATF4                         369
#define LF5                           370
#define LATF5                         371
#define LF6                           372
#define LATF6                         373
#define LF7                           374
#define LATF7                         375
#define LATG                          376
#define LATG0                         377
#define LG0                           378
#define LATG1                         379
#define LG1                           380
#define LATG2                         381
#define LG2                           382
#define LATG3                         383
#define LG3                           384
#define LATG4                         385
#define LG4                           386
#define LATH                          387
#define LH0                           388
#define LATH0                         389
#define LH1                           390
#define LATH1                         391
#define LH2                           392
#define LATH2                         393
#define LH3                           394
#define LATH3                         395
#define LH4                           396
#define LATH4                         397
#define LH5                           398
#define LATH5                         399
#define LH6                           400
#define LATH6                         401
#define LH7                           402
#define LATH7                         403
#define LATJ                          404
#define LATJ0                         405
#define LJ0                           406
#define LATJ1                         407
#define LJ1                           408
#define LATJ2                         409
#define LJ2                           410
#define LATJ3                         411
#define LJ3                           412
#define LATJ4                         413
#define LJ4                           414
#define LATJ5                         415
#define LJ5                           416
#define LATJ6                         417
#define LJ6                           418
#define LATJ7                         419
#define LJ7                           420
#define TRISA                         421
#define TRISA0                        422
#define TRISA_RA0                     423
#define TRISA1                        424
#define TRISA_RA1                     425
#define TRISA2                        426
#define TRISA_RA2                     427
#define TRISA3                        428
#define TRISA_RA3                     429
#define TRISA_RA4                     430
#define TRISA4                        431
#define TRISA_RA5                     432
#define TRISA5                        433
#define TRISA_RA6                     434
#define TRISA6                        435
#define TRISA_RA7                     436
#define TRISA7                        437
#define TRISB                         438
#define TRISB_RB0                     439
#define TRISB0                        440
#define TRISB_RB1                     441
#define TRISB1                        442
#define TRISB_RB2                     443
#define TRISB2                        444
#define TRISB_RB3                     445
#define TRISB3                        446
#define RB4                           447
#define TRISB4                        448
#define TRISB_RB5                     449
#define TRISB5                        450
#define TRISB_RB6                     451
#define TRISB6                        452
#define TRISB_RB7                     453
#define TRISB7                        454
#define TRISC                         455
#define TRISC0                        456
#define TRISC_RC0                     457
#define TRISC1                        458
#define TRISC_RC1                     459
#define TRISC2                        460
#define TRISC_RC2                     461
#define TRISC3                        462
#define TRISC_RC3                     463
#define TRISC4                        464
#define TRISC_RC4                     465
#define TRISC5                        466
#define TRISC_RC5                     467
#define TRISC6                        468
#define TRISC_RC6                     469
#define TRISC7                        470
#define TRISC_RC7                     471
#define TRISD                         472
#define TRISD_RD0                     473
#define TRISD0                        474
#define TRISD_RD1                     475
#define TRISD1                        476
#define TRISD_RD2                     477
#define TRISD2                        478
#define TRISD_RD3                     479
#define TRISD3                        480
#define TRISD_RD4                     481
#define TRISD4                        482
#define TRISD_RD5                     483
#define TRISD5                        484
#define TRISD_RD6                     485
#define TRISD6                        486
#define TRISD_RD7                     487
#define TRISD7                        488
#define TRISE                         489
#define TRISE_RE0                     490
#define TRISE0                        491
#define TRISE1                        492
#define TRISE_RE1                     493
#define TRISE2                        494
#define TRISE_RE2                     495
#define TRISE_RE3                     496
#define TRISE3                        497
#define TRISE_RE4                     498
#define TRISE4                        499
#define TRISE_RE5                     500
#define TRISE5                        501
#define TRISE_RE6                     502
#define TRISE6                        503
#define TRISE_RE7                     504
#define TRISE7                        505
#define TRISF                         506
#define TRISF0                        507
#define TRISF_RF0                     508
#define TRISF_RF1                     509
#define TRISF1                        510
#define TRISF_RF2                     511
#define TRISF2                        512
#define TRISF3                        513
#define TRISF_RF3                     514
#define TRISF_RF4                     515
#define TRISF4                        516
#define TRISF_RF5                     517
#define TRISF5                        518
#define TRISF_RF6                     519
#define TRISF6                        520
#define TRISF7                        521
